In [1]:
import pandas as pd

In [2]:
csv_path = "JNJ.csv"
jnj_df = pd.read_csv(csv_path)

In [3]:
jnj_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2015-01-01,105.050003,106.500000,100.089996,100.139999,86.143509,195025900
1,2015-02-01,100.489998,103.330002,97.150002,102.510002,88.182259,191367400
2,2015-03-01,102.510002,103.410004,98.220001,100.599998,87.144989,177464600
3,2015-04-01,100.459999,102.139999,98.040001,99.199997,85.932236,171578200
4,2015-05-01,99.620003,104.480003,98.660004,100.139999,86.746529,143779800

In [4]:
# Rename Adj Close column to Ticker Symbol for the Stock.
jnj_df = jnj_df.rename(columns = {'Adj Close': 'JNJ'})
jnj_df.head()

,Date,Open,High,Low,Close,JNJ,Volume
0,2015-01-01,105.050003,106.500000,100.089996,100.139999,86.143509,195025900
1,2015-02-01,100.489998,103.330002,97.150002,102.510002,88.182259,191367400
2,2015-03-01,102.510002,103.410004,98.220001,100.599998,87.144989,177464600
3,2015-04-01,100.459999,102.139999,98.040001,99.199997,85.932236,171578200
4,2015-05-01,99.620003,104.480003,98.660004,100.139999,86.746529,143779800

In [5]:
# Drop all columns except Date & Renamed Ticker Symbol column
jnj_clean = jnj_df[['Date','JNJ']]
jnj_clean.head()

         Date        JNJ
0  2015-01-01  86.143509
1  2015-02-01  88.182259
2  2015-03-01  87.144989
3  2015-04-01  85.932236
4  2015-05-01  86.746529

In [6]:
# Make sure length is 60
len(jnj_clean)

60

In [7]:
# Check for Null Values
len(jnj_clean.dropna())

60

In [8]:
jnj_clean.to_csv('JNJ_clean.csv')

In [9]:
ko_path = "KO.csv"
ko_df = pd.read_csv(ko_path)

In [10]:
ko_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2015-01-01,42.259998,43.830002,41.110001,41.169998,34.362114,293092200
1,2015-02-01,41.209999,43.660000,40.900002,43.299999,36.139900,291647700
2,2015-03-01,43.299999,43.299999,39.610001,40.549999,33.844646,370738500
3,2015-04-01,40.790001,41.610001,40.099998,40.560001,34.133892,284020300
4,2015-05-01,40.580002,41.689999,40.389999,40.959999,34.470516,230592600

In [11]:
# Rename Adj Close column to Ticker Symbol for the Stock.
ko_df = ko_df.rename(columns = {'Adj Close': 'KO'})
ko_df.head()

,Date,Open,High,Low,Close,KO,Volume
0,2015-01-01,42.259998,43.830002,41.110001,41.169998,34.362114,293092200
1,2015-02-01,41.209999,43.660000,40.900002,43.299999,36.139900,291647700
2,2015-03-01,43.299999,43.299999,39.610001,40.549999,33.844646,370738500
3,2015-04-01,40.790001,41.610001,40.099998,40.560001,34.133892,284020300
4,2015-05-01,40.580002,41.689999,40.389999,40.959999,34.470516,230592600

In [12]:
# Drop all columns except Date & Renamed Ticker Symbol column
ko_clean = ko_df[['Date','KO']]
ko_clean.head()

         Date         KO
0  2015-01-01  34.362114
1  2015-02-01  36.139900
2  2015-03-01  33.844646
3  2015-04-01  34.133892
4  2015-05-01  34.470516

In [13]:
# Make sure length is 60
len(ko_clean)

60

In [14]:
# Check for Null Values
len(ko_clean.dropna())

60

In [15]:
ko_clean.to_csv('KO_clean.csv')

In [16]:
mcd_path = "MCD.csv"
mcd_df = pd.read_csv(mcd_path)

In [17]:
mcd_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2015-01-01,94.129997,95.000000,88.769997,92.440002,79.450264,152776400
1,2015-02-01,92.050003,99.879997,91.430000,98.900002,85.002525,141328000
2,2015-03-01,98.900002,101.089996,94.940002,97.440002,84.475479,164772700
3,2015-04-01,96.809998,99.349998,94.459999,96.550003,83.703888,136319600
4,2015-05-01,96.730003,101.080002,95.570000,95.930000,83.166382,131649800

In [18]:
# Rename Adj Close column to Ticker Symbol for the Stock.
mcd_df = mcd_df.rename(columns = {'Adj Close': 'MCD'})
mcd_df.head()

,Date,Open,High,Low,Close,MCD,Volume
0,2015-01-01,94.129997,95.000000,88.769997,92.440002,79.450264,152776400
1,2015-02-01,92.050003,99.879997,91.430000,98.900002,85.002525,141328000
2,2015-03-01,98.900002,101.089996,94.940002,97.440002,84.475479,164772700
3,2015-04-01,96.809998,99.349998,94.459999,96.550003,83.703888,136319600
4,2015-05-01,96.730003,101.080002,95.570000,95.930000,83.166382,131649800

In [19]:
# Drop all columns except Date & Renamed Ticker Symbol column
mcd_clean = mcd_df[['Date','MCD']]
mcd_clean.head()

         Date        MCD
0  2015-01-01  79.450264
1  2015-02-01  85.002525
2  2015-03-01  84.475479
3  2015-04-01  83.703888
4  2015-05-01  83.166382

In [20]:
# Make sure length is 60
len(mcd_clean)

60

In [21]:
# Check for Null Values
len(mcd_clean.dropna())

60

In [23]:
mcd_clean.to_csv('MCD_clean.csv')

In [24]:
sbux_path = "SBUX.csv"
sbux_df = pd.read_csv(sbux_path)

FileNotFoundError: [Errno 2] File SBUX.csv does not exist: 'SBUX.csv'

In [17]:
mcd_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2015-01-01,94.129997,95.000000,88.769997,92.440002,79.450264,152776400
1,2015-02-01,92.050003,99.879997,91.430000,98.900002,85.002525,141328000
2,2015-03-01,98.900002,101.089996,94.940002,97.440002,84.475479,164772700
3,2015-04-01,96.809998,99.349998,94.459999,96.550003,83.703888,136319600
4,2015-05-01,96.730003,101.080002,95.570000,95.930000,83.166382,131649800

In [18]:
# Rename Adj Close column to Ticker Symbol for the Stock.
mcd_df = mcd_df.rename(columns = {'Adj Close': 'MCD'})
mcd_df.head()

,Date,Open,High,Low,Close,MCD,Volume
0,2015-01-01,94.129997,95.000000,88.769997,92.440002,79.450264,152776400
1,2015-02-01,92.050003,99.879997,91.430000,98.900002,85.002525,141328000
2,2015-03-01,98.900002,101.089996,94.940002,97.440002,84.475479,164772700
3,2015-04-01,96.809998,99.349998,94.459999,96.550003,83.703888,136319600
4,2015-05-01,96.730003,101.080002,95.570000,95.930000,83.166382,131649800

In [19]:
# Drop all columns except Date & Renamed Ticker Symbol column
mcd_clean = mcd_df[['Date','MCD']]
mcd_clean.head()

         Date        MCD
0  2015-01-01  79.450264
1  2015-02-01  85.002525
2  2015-03-01  84.475479
3  2015-04-01  83.703888
4  2015-05-01  83.166382

In [13]:
# Make sure length is 60
len(mcd_clean)

60

In [14]:
# Check for Null Values
len(mcd_clean.dropna())

60

In [20]:
mcd_clean.to_csv('MCD_clean.csv')